In [18]:
import pandas as pd
import numpy as np

In [102]:
df = pd.read_csv('StudentsPerformance.csv')
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

## groupby which is used to group by non aggregated columns 
## based on group by we can perform aggregation functions ex: min,max,mean,sum

In [19]:
groups_values = df.groupby('gender')

In [20]:
groups_values

In [21]:
res = groups_values.groups # groups is a varaiable which returns dictionary and it keeps values as unique values

In [22]:
res.keys()

dict_keys(['female', 'male'])

In [23]:
res['female']

Index([  0,   1,   2,   5,   6,   9,  12,  14,  15,  17,
       ...
       986, 988, 989, 991, 992, 993, 995, 997, 998, 999],
      dtype='int64', length=518)

In [24]:
res['male']

Index([  3,   4,   7,   8,  10,  11,  13,  16,  18,  20,
       ...
       976, 977, 978, 981, 982, 985, 987, 990, 994, 996],
      dtype='int64', length=482)

## dataframe.get_group()

## get_groups is used to extract particular grouped records
### it is case sensitive

In [25]:
groups_values.get_group('female')

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
...,...,...,...,...,...,...,...,...
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
995,female,group E,master's degree,standard,completed,88,99,95
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

## male ------|group A |
##            |group B | --- count
##            |group C |

## female ------|group A |
##              |group B | --- count
##              |group C |

In [ ]:
grouped_column = df.groupby('gender')

In [48]:
male = grouped_column.get_group('male')
female = grouped_column.get_group('female')

In [51]:
male['race/ethnicity'].value_counts(ascending=True)

race/ethnicity
group A     53
group E     71
group B     86
group D    133
group C    139
Name: count, dtype: int64

In [52]:
female['race/ethnicity'].value_counts(ascending=True)

race/ethnicity
group A     36
group E     69
group B    104
group D    129
group C    180
Name: count, dtype: int64

In [54]:
df.groupby('gender')['race/ethnicity'].value_counts(ascending=True)

gender  race/ethnicity
female  group A            36
        group E            69
        group B           104
        group D           129
        group C           180
male    group A            53
        group E            71
        group B            86
        group D           133
        group C           139
Name: count, dtype: int64

In [55]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [70]:
g_c = df.groupby('gender')['writing score'].mean()
g_c

gender
female    72.467181
male      63.311203
Name: writing score, dtype: float64

## get the group A along with associate degree of male

In [81]:
df['gender'] = 'male'
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,male,group B,bachelor's degree,standard,none,72,72,74
1,male,group C,some college,standard,completed,69,90,88
2,male,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,male,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,male,group C,high school,free/reduced,completed,59,71,65
998,male,group D,some college,standard,completed,68,78,77
999,male,group D,some college,free/reduced,none,77,86,86

In [ ]:
df.query('(gender == "male") & (`race/ethnicity` == "group A") & (`parental level of education` == "associate\'s degree")')

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
3,male,group A,associate's degree,free/reduced,none,47,57,44
62,male,group A,associate's degree,free/reduced,none,62,61,55
112,male,group A,associate's degree,standard,none,54,53,47
356,male,group A,associate's degree,standard,none,63,61,61
489,male,group A,associate's degree,free/reduced,completed,79,82,82
539,male,group A,associate's degree,standard,completed,97,92,86
575,male,group A,associate's degree,free/reduced,completed,40,55,53
936,male,group A,associate's degree,standard,none,67,57,53

In [99]:
df[(df['gender'] == 'male') & (df['race/ethnicity'] == "group A") & (df['parental level of education'] == "associate's degree")]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
3,male,group A,associate's degree,free/reduced,none,47,57,44
62,male,group A,associate's degree,free/reduced,none,62,61,55
112,male,group A,associate's degree,standard,none,54,53,47
356,male,group A,associate's degree,standard,none,63,61,61
489,male,group A,associate's degree,free/reduced,completed,79,82,82
539,male,group A,associate's degree,standard,completed,97,92,86
575,male,group A,associate's degree,free/reduced,completed,40,55,53
936,male,group A,associate's degree,standard,none,67,57,53

In [ ]:
gv = groups.groupby(['gender','race/ethnicity','parental level of education'])
gv.get_group(('male','group A','associate\'s degree'))